-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: May 20, 2025 at 10:21 AM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.0.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `kantang_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `testexcel`
--

CREATE TABLE `testexcel` (
  `id` int(11) NOT NULL,
  `หัวข้อ/เรื่อง` varchar(255) DEFAULT NULL,
  `หัวข้อที่1` varchar(255) DEFAULT NULL,
  `หัวข้อที่ 2` varchar(255) DEFAULT NULL,
  `หัวข้อที่ 3` varchar(255) DEFAULT NULL,
  `หัวข้อที่ 4` varchar(255) DEFAULT NULL,
  `หัวข้อที่ 5` varchar(255) DEFAULT NULL,
  `หัวข้อที่ 6` varchar(255) DEFAULT NULL,
  `หัวข้อที่ 7` varchar(255) DEFAULT NULL,
  `หัวข้อที่ 8` varchar(255) DEFAULT NULL,
  `หัวข้อที่ 9` varchar(255) DEFAULT NULL,
  `หัวข้อที่ 10` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `testexcel`
--

INSERT INTO `testexcel` (`id`, `หัวข้อ/เรื่อง`, `หัวข้อที่1`, `หัวข้อที่ 2`, `หัวข้อที่ 3`, `หัวข้อที่ 4`, `หัวข้อที่ 5`, `หัวข้อที่ 6`, `หัวข้อที่ 7`, `หัวข้อที่ 8`, `หัวข้อที่ 9`, `หัวข้อที่ 10`) VALUES
(1, 'เรื่องที่ 1', '10', '', '', '', '', '', '', '', '', ''),
(2, 'เรื่องที่ 2', '20', '', '', '', '', '', '', '', '', ''),
(3, 'เรื่องที่ 3', '30', '', '', '', '', '', '', '', '', ''),
(4, 'เรื่องที่ 4', '40', '', '', '', '', '', '', '', '', ''),
(5, 'เรื่องที่ 5', '', '50', '', '', '', '', '', '', '', ''),
(6, 'เรื่องที่ 6', '', '', '', '', '', '', '', '', '', ''),
(7, 'เรื่องที่ 7', '', '', '', '', '', '', '', '', '', ''),
(8, 'เรื่องที่ 8', '', '', '', '', '', '', '', '', '', ''),
(9, 'เรื่องที่ 9', '', '', '', '', '', '', '', '', '', ''),
(10, 'เรื่องที่ 10', '', '', '', '', '', '', '', '', '', ''),
(11, 'เรื่องที่ 11', '', '', '', '', '', '', '', '', '', ''),
(12, 'เรื่องที่ 12', '', '', '', '', '', '', '', '', '', ''),
(13, 'เรื่องที่ 13', '', '', '', '', '', '', '', '', '', ''),
(14, 'เรื่องที่ 14', '', '', '', '', '', '', '', '', '', ''),
(15, 'เรื่องที่ 15', '', '', '', '', '', '', '', '', '', ''),
(16, 'เรื่องที่ 16', '', '', '', '', '', '', '', '', '', ''),
(17, 'เรื่องที่ 17', '', '', '', '', '', '', '', '', '', ''),
(18, 'เรื่องที่ 18', '', '', '', '', '', '', '', '', '', ''),
(19, 'เรื่องที่ 19', '', '', '', '', '', '', '', '', '', ''),
(20, 'เรื่องที่ 20', '', '', '', '', '', '', '', '', '', '');

-- --------------------------------------------------------

--
-- Table structure for table `testexcel2`
--

CREATE TABLE `testexcel2` (
  `id` int(11) NOT NULL,
  `หัวข้อ/เรื่อง` varchar(255) DEFAULT NULL,
  `หัวข้อที่1` varchar(255) DEFAULT NULL,
  `หัวข้อที่ 2` varchar(255) DEFAULT NULL,
  `หัวข้อที่ 3` varchar(255) DEFAULT NULL,
  `หัวข้อที่ 4` varchar(255) DEFAULT NULL,
  `หัวข้อที่ 5` varchar(255) DEFAULT NULL,
  `หัวข้อที่ 6` varchar(255) DEFAULT NULL,
  `หัวข้อที่ 7` varchar(255) DEFAULT NULL,
  `หัวข้อที่ 8` varchar(255) DEFAULT NULL,
  `หัวข้อที่ 9` varchar(255) DEFAULT NULL,
  `หัวข้อที่ 10` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `testexcel2`
--

INSERT INTO `testexcel2` (`id`, `หัวข้อ/เรื่อง`, `หัวข้อที่1`, `หัวข้อที่ 2`, `หัวข้อที่ 3`, `หัวข้อที่ 4`, `หัวข้อที่ 5`, `หัวข้อที่ 6`, `หัวข้อที่ 7`, `หัวข้อที่ 8`, `หัวข้อที่ 9`, `หัวข้อที่ 10`) VALUES
(1, 'เรื่องที่ 1', '', '', '', '', '', '', '', '', '', ''),
(2, 'เรื่องที่ 2', '', '', '', '', '', '', '', '', '', ''),
(3, 'เรื่องที่ 3', '', '', '', '', '', '', '', '', '', ''),
(4, 'เรื่องที่ 4', '', '', '', '', '', '', '', '', '', ''),
(5, 'เรื่องที่ 5', '', '', '', '', '', '', '', '', '', ''),
(6, 'เรื่องที่ 6', '', '', '', '', '', '', '', '', '', ''),
(7, 'เรื่องที่ 7', '', '', '', '', '', '', '', '', '', ''),
(8, 'เรื่องที่ 8', '', '', '', '', '', '', '', '', '', ''),
(9, 'เรื่องที่ 9', '', '', '', '', '', '', '', '', '', ''),
(10, 'เรื่องที่ 10', '', '', '', '', '', '', '', '', '', ''),
(11, 'เรื่องที่ 11', '', '', '', '', '', '', '', '', '', ''),
(12, 'เรื่องที่ 12', '', '', '', '', '', '', '', '', '', ''),
(13, 'เรื่องที่ 13', '', '', '', '', '', '', '', '', '', ''),
(14, 'เรื่องที่ 14', '', '', '', '', '', '', '', '', '', ''),
(15, 'เรื่องที่ 15', '', '', '', '', '', '', '', '', '', ''),
(16, 'เรื่องที่ 16', '', '', '', '', '', '', '', '', '', ''),
(17, 'เรื่องที่ 17', '', '', '', '', '', '', '', '', '', ''),
(18, 'เรื่องที่ 18', '', '', '', '', '', '', '', '', '', ''),
(19, 'เรื่องที่ 19', '', '', '', '', '', '', '', '', '', ''),
(20, 'เรื่องที่ 20', '', '', '', '', '', '', '', '', '', '');

-- --------------------------------------------------------

--
-- Table structure for table `uploaded_file`
--

CREATE TABLE `uploaded_file` (
  `id` int(11) NOT NULL,
  `filename` varchar(255) NOT NULL,
  `filepath` varchar(255) NOT NULL,
  `uploaded_by` varchar(50) DEFAULT NULL,
  `uploaded_at` datetime DEFAULT current_timestamp(),
  `allowed_users` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `uploaded_file`
--

INSERT INTO `uploaded_file` (`id`, `filename`, `filepath`, `uploaded_by`, `uploaded_at`, `allowed_users`) VALUES
(47, 'testexcel.xlsx', '../uploads/testexcel.xlsx', 'tester1', '2025-05-20 11:04:01', 'tester2'),
(48, 'testexcel2.xlsx', '../uploads/testexcel2.xlsx', 'tester1', '2025-05-20 11:43:27', 'tester2,tester3');

-- --------------------------------------------------------

--
-- Table structure for table `user_his`
--

CREATE TABLE `user_his` (
  `id` int(11) NOT NULL,
  `role` enum('user','admin') NOT NULL,
  `username` varchar(255) NOT NULL,
  `name` varchar(50) NOT NULL,
  `password` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `user_his`
--

INSERT INTO `user_his` (`id`, `role`, `username`, `name`, `password`) VALUES
(1, 'user', '0874698970', 'พีระยุทธ ทวิสุวรรณ์', '11407'),
(2, 'user', '11945', 'เทศบาลตำบลกันตัง', '11407'),
(3, 'user', '28054', 'นพ.ชำนาญ วรสุวรรณรักษ์', '11407'),
(4, 'user', '28769', 'นพ.ชัยณรงค์  มากเพ็ง', '11407'),
(5, 'user', '36616', 'นาย กฤษฎา วงศ์ศรีตรัง', '11407'),
(6, 'user', '4860001', 'ทพ.กนกวรรณ ศรีขำ', '11407'),
(7, 'user', '49568', 'พญ.โชติมา  เต็งรัง', '11407'),
(8, 'user', '52119', 'พญ.เพ็ญบุญญา  สีชุม', '11407'),
(9, 'user', '56517', 'นพ.ภัทธร ฮายุกต์', '11407'),
(10, 'user', '64830', 'พญ.ณัฏฐ์วรินท์ วณิชชานนท์', '11407'),
(11, 'user', '64838', 'นพ.ธฤต วิประกษิต', '11407'),
(12, 'user', '66225', 'นพ.ปิยะพงษ์ ไพศาลวัชรกิจ', '11407'),
(13, 'user', '66947', 'พญ.ณัฐพร มุสิกพันธ์', '11407'),
(14, 'user', '66954', 'พญ.นัฎศรา เดชธราดล', '11407'),
(15, 'user', '67504', 'พ.ญ.พิมพ์ลภัส รักไทย', '11407'),
(16, 'user', '67887', 'นพ.สมิทธิ สุดเดือน', '11407'),
(17, 'user', '69738', 'นพ.สุทธิพัฒน์ เลิศไพศาลพิพัฒน์', '11407'),
(18, 'user', '69748', 'นพ. วชิรวิทย์ แก้วประชุม', '11407'),
(19, 'user', '69771', 'นพ.พชร ว่องไวยุทธ์', '11407'),
(20, 'user', '72463', 'พญ.กุลวานีย์ อีแต', '11407'),
(21, 'user', '72797', 'พญ.ปัณฑิตา คงนคร', '11407'),
(22, 'user', '72819', 'พญ.อภิสรา วิเชียรณรัตน์', '11407'),
(23, 'user', 'adminbet', 'นายสุทิน ลำแก้ว', '11407'),
(24, 'user', 'amm0509', 'น.ส.นาฎอนงค์ เพชรฤทธิ์', '11407'),
(25, 'user', 'amonwan', 'น.ส.อมลวรรณ  ผลิผล', '11407'),
(26, 'user', 'amp', 'อทิตา  หยงสตาร์ ทน.7638', '11407'),
(27, 'user', 'andy', 'นาย ธนวัฒน์ หนูนารถ', '11407'),
(28, 'user', 'angle', 'นางอัจฉราภรณ์ หลงละเลิง', '11407'),
(29, 'user', 'Anne', 'นางสาวสายใจ  นกแก้ว', '11407'),
(30, 'user', 'annt', 'ฤดีมาศ จิวะสุรัตน์', '11407'),
(31, 'user', 'anuyut', 'นายอนุยุต ตระกูลอำนวยลาภ ทน.', '11407'),
(32, 'user', 'aon', 'นางสาวอรอุมา เกตุบุญ', '11407'),
(33, 'user', 'apichaya', 'น.ส.อภิชญา ช่องรักษ์', '11407'),
(34, 'user', 'Aranyaporn', 'นางสาว อรัญญาพร สิทธิชัย', '11407'),
(35, 'user', 'Arthittaya', 'นางสาว อาทิตยา ชูยัง ทน.22597', '11407'),
(36, 'user', 'atchara', 'นางอัจฉรา ส่อสืบ', '11407'),
(37, 'user', 'atom', 'น.ส.ธนภัสสรร์ ศีตลาศุภานิช', '11407'),
(38, 'user', 'atorn', 'นาย อาทร พูลภิรมย์', '11407'),
(39, 'user', 'aut', 'อัจฉราวรรณ  บุญพรหม', '11407'),
(40, 'user', 'awasada', 'นางสาวอวัสดา ขาวบาง', '11407'),
(41, 'user', 'azan', 'น.ส.อุมาภรณ์ เพชร์สนั่น', '11407'),
(42, 'user', 'balm', 'น.ส.ธมลวรรณ แซ่หลี', '11407'),
(43, 'user', 'banana', 'นาง สุปราณี  หาบหา', '11407'),
(44, 'user', 'bany', 'นายบัญญัติ  ศรีแดง', '11407'),
(45, 'user', 'bean', 'น.ส.สรณ์วรรณรัตน์  หนักแน่น', '11407'),
(46, 'user', 'bindoom', 'นายสุทัศน์ ลำแก้ว', '11407'),
(47, 'user', 'brownyka', 'น.ส.อภิรดี   ภักดีโชติ', '11407'),
(48, 'user', 'bus', 'นางหัสปียะ หมานเสม', '11407'),
(49, 'user', 'Busakorn', 'นางสาว บุษกร เขียดนุ้ย', '11407'),
(50, 'user', 'chamiporn', 'นางชไมพร กิ้มเส้ง', '11407'),
(51, 'user', 'chamnan', 'นพ.ชำนาญ วรสุวรรณรักษ์', '11407'),
(52, 'user', 'chan', 'นายธวัชชัย  กังแฮ', '11407'),
(53, 'user', 'chapa', 'ชะปา  คงแก้ว', '11407'),
(54, 'user', 'chitchanok', 'น.ส. ชิดชนก แสงประจง', '11407'),
(55, 'user', 'cyl260958', 'นางสลักจิต  บุญถนอม', '11407'),
(56, 'user', 'cyr', 'ภก.ชยรักษ์ นาคช่วย', '11407'),
(57, 'user', 'dang', 'เอื้องไพร พรมจิตร์', '11407'),
(58, 'user', 'ddd', 'น.ส.ดวงแก้ว สุทธินนท์', '11407'),
(59, 'user', 'DMscreen', 'หน้าห้องตรวจคลินิกพิเศษ รพช.', '11407'),
(60, 'user', 'f1', 'นาย ณัฐปกรณ์ จันดี', '11407'),
(61, 'user', 'fern', 'น.ส ธนพร เป้าทอง', '11407'),
(62, 'user', 'first', 'นาย ณัชฐปกรณ์ จันดี', '11407'),
(63, 'user', 'gift', 'น.ส.จำเริญสุข ขาวบาง', '11407'),
(64, 'user', 'hameedah', 'น.ส.ฮามีดะห์  เซ็ง', '11407'),
(65, 'user', 'honey', 'น.ส.กมลรัตน์ นวลศรี', '11407'),
(66, 'user', 'iampj', 'น.ส.ปิยะดา ใจตรง', '11407'),
(67, 'user', 'inst', 'เวชภัณฑ์', '11407'),
(68, 'user', 'itchaya', 'น.ส.อิชยา  สินไชย', '11407'),
(69, 'user', 'j1723', 'นางถลัชนันท์  พลชา', '11407'),
(70, 'user', 'jaffey', 'น.ส.จันทร์ฉาย หมาดหวา', '11407'),
(71, 'user', 'jam', 'จุติมา ขวัญทอง', '11407'),
(72, 'user', 'janejoe', 'นางสาวเจนจิรา สิทธิ์ชัย', '11407'),
(73, 'user', 'JANTIP', 'ทพญ.จันทร์ทิพย์  อินทร์สังข์', '11407'),
(74, 'user', 'jareeporn', 'น.ส.จรีภรณ์  เสาทอง', '11407'),
(75, 'user', 'jariya', 'จริยา จันทร์ฝาก', '11407'),
(76, 'user', 'jeen', 'นางฐิตาภา  ขุนราช', '11407'),
(77, 'user', 'jelly', 'นางจุลีพร วัฒนพรชัยสิริ', '11407'),
(78, 'user', 'jenjira', 'พญ.เจนจิรา  ตั่นเล่ง', '11407'),
(79, 'user', 'jesica', 'นางอรัญญา ธรรมเสถียร', '11407'),
(80, 'user', 'jetaimez', 'ณัฐพล หยิบงามเจริญสุข', '11407'),
(81, 'user', 'jickausana', 'น.ส.อุษณา โกเอี้ยน', '11407'),
(82, 'user', 'jik', 'นางสาวนิภาพร ปังตา', '11407'),
(83, 'user', 'jim', 'นพ.ชาญชัย สามัคคีนิชย์', '11407'),
(84, 'user', 'jirawan', 'นางจิรวรรณ  สุขรุ่ง', '11407'),
(85, 'user', 'jittrawan', 'พญ.จิตราวรรณ จันทร์มา', '11407'),
(86, 'user', 'jojo0316', 'นายไรนาน เหล็มหวัง', '11407'),
(87, 'user', 'jome11', 'นายณัฐวัตร คชหาญ', '11407'),
(88, 'user', 'jou99', 'พญ.สุภัค หลิมศิโรรัตน์', '11407'),
(89, 'user', 'joy', 'น.ส.อุดมพร  ก๊กใหญ่', '11407'),
(90, 'user', 'judy11407', 'นางโสภาพร เสน่หา', '11407'),
(91, 'user', 'juleeporn', 'นางจุลีพร วัฒนพรชัยสิริ', '11407'),
(92, 'user', 'june', 'อัจจิมา ลำแก้ว', '11407'),
(93, 'user', 'jupjang', 'นางบุษฎี สงเทพ', '11407'),
(94, 'user', 'jutamassee', 'น.ส.จุฑามาศ สีสุข', '11407'),
(95, 'user', 'jutapon', 'น.ส.จุฑาภรณ์   ศรีสุข', '11407'),
(96, 'user', 'jutaporn', 'น.ส.จุฑาพร   สังคะดี', '11407'),
(97, 'user', 'jutatip', 'น.ส.จุฑาทิพย์  เสนีย์', '11407'),
(98, 'user', 'jutatip2533', 'น.ส.จุฑาทิพย์ อ่อนชาติ', '11407'),
(99, 'user', 'kai', 'นายกนกพร จุลบุษรา', '11407'),
(100, 'user', 'kanchanok', 'นางกานต์ชนก   แซ่ตั้น', '11407'),
(101, 'user', 'kanha', 'นางกัญหา หนูลอย', '11407'),
(102, 'user', 'kanitta9330', 'น.ส.ขนิษฐา  หมันหมีน', '11407'),
(103, 'user', 'kanjana', 'น.ส.กาญจนา  ไขสะ', '11407'),
(104, 'user', 'kannika', 'น.ส.กรรณิการ์ บุญพาฤทธิ์', '11407'),
(105, 'user', 'kasidit', 'นายกษิดิศ  กิ้มเฉี้ยง', '11407'),
(106, 'user', 'khunanya', 'น.ส.คุณัญญา ระยา', '11407'),
(107, 'user', 'kimmy', 'นายกษิดิศ  กิ้มเฉี้ยง', '11407'),
(108, 'user', 'kitty', 'น.ส.อารียภรณ์ ยกทิว', '11407'),
(109, 'user', 'kongju', 'รุ่งระวี  ตั้นสุย', '11407'),
(110, 'user', 'konika', 'ภญ.กรรณิการ์ สงรักษา', '11407'),
(111, 'user', 'koriya', 'น.ส.จันทร์แรม  เทอดกิติวรางค์', '11407'),
(112, 'user', 'korn', 'นางสาวนิสาคร วีระกุล', '11407'),
(113, 'user', 'koteeya', 'น.ส.ก่อตียะ  หมาดเหล่', '11407'),
(114, 'user', 'koy081', 'น.ส.กฤษณา นาชิน', '11407'),
(115, 'user', 'kratare', 'พญ.สุภารัตน์ วัฒนา', '11407'),
(116, 'user', 'kung', 'นพ.วีรยุทธ อธิภัทรพงศ์', '11407'),
(117, 'user', 'KWAN', 'ทพ.ญ.ศกลวรรณ  ขวัญแก้ว', '11407'),
(118, 'user', 'kwun', 'สาวิตรี สักกะพลางกูร', '11407'),
(119, 'user', 'Lalita', 'นางสาว ลลิตา ดิษฐ์เดช', '11407'),
(120, 'user', 'lek22', 'ทพ.ภาคภูมิ ธรรมเจริญวิภาส', '11407'),
(121, 'user', 'lookkaew', 'น.ส.กานต์มณี อ้วนข้อง', '11407'),
(122, 'user', 'lupnayong', 'นายอภิชาติ จันทร์หอม', '11407'),
(123, 'user', 'maliwan', 'น.ส.มะลิวัลย์ ขวัญดำ', '11407'),
(124, 'user', 'mam', 'ธัญญา เหล่าตรังสกุล', '11407'),
(125, 'user', 'mamoomameaw', 'ทพ.ญ.ดวงหทัย เอี่ยมวิถีวนิช', '11407'),
(126, 'user', 'Manatsawan', 'น.ส.มนัสวรรณ ฉิมเรือง', '11407'),
(127, 'user', 'matinee', 'นางเมทินี เคียมเค้า', '11407'),
(128, 'user', 'matuwan', 'มธุวรรณ บุรีนอก', '11407'),
(129, 'user', 'mental', 'คลินิกสุขภาพจิต รพช', '11407'),
(130, 'user', 'milkit', 'นางสิริกานต์ ยี่ภู่รัตน์', '11407'),
(131, 'user', 'mintra', 'พท.มินตรา  ตันสุย', '11407'),
(132, 'user', 'mollapiya', 'น.ส.ปิยพร  รอดเพ็ง', '11407'),
(133, 'user', 'montita', 'น.ส.มณฑิตา  เปาะหะ', '11407'),
(134, 'user', 'moopee', 'น.ส.อรพิน  แซ่เตียว', '11407'),
(135, 'user', 'nadear', 'น.ส.จำเนียร ศรีเรืองรัตน์', '11407'),
(136, 'user', 'Naiyachon', 'นายไนยชน บุญเอิบ', '11407'),
(137, 'user', 'namfon', 'น.ส.กมลรัตน์ ด่อหล๊ะ', '11407'),
(138, 'user', 'namrj', 'น.ส.รุ่งไพลิน จุลบุษรา ทน.16650', '11407'),
(139, 'user', 'nangnoi', 'น.ส.ดาฤมล  นุ่นแก้ว', '11407'),
(140, 'user', 'nantawan', 'นางนันตะวัน  แสงรัตน์', '11407'),
(141, 'user', 'napaporn', 'น.ส.นภาภรณ์ ด้วงมาก', '11407'),
(142, 'user', 'NAPASORN', 'นางนภสร  ศรีปล้อง', '11407'),
(143, 'user', 'Natkanwadee', 'นางสาว กัญจน์วดี กิ้มเจี้ยม', '11407'),
(144, 'user', 'nattaya', 'น.ส.นัทยา  ขวัญแก้ว', '11407'),
(145, 'user', 'Natttanicha', 'นางสาว ณัฎฐนิชา อุ่นใจ', '11407'),
(146, 'user', 'natty', 'นางณัฐมน  เตางาม', '11407'),
(147, 'user', 'nee3639', 'จารุณี จิโรจน์กุล', '11407'),
(148, 'user', 'nice', 'สุจริยา ฤทธิเดช', '11407'),
(149, 'user', 'nkmr', 'น.ส.กมลรัตน์  นุ่นคง', '11407'),
(150, 'user', 'nok0203', 'น.ส.อรอุมา นาพอ', '11407'),
(151, 'user', 'nokk', 'นาง สุวิมล จิตรแก้ว', '11407'),
(152, 'user', 'nongluk', 'น.ส.นงลักษณ์  หลังเจะนุ้ย', '11407'),
(153, 'user', 'nooch', 'นุชนาฏ มลยงค์', '11407'),
(154, 'user', 'nooknick', 'นางวัลภา  มาศวิเชียร', '11407'),
(155, 'user', 'Noomeaw', 'น.ส.อัจจิมา จูห้อง', '11407'),
(156, 'user', 'noot', 'นางสาวชนม์นิภา  เพชรประสิทธิ์', '11407'),
(157, 'user', 'nso', 'กลุ่มการพยาบาล', '11407'),
(158, 'user', 'nuch', 'น.ส. ปรียานุช แก้วนำ', '11407'),
(159, 'user', 'nuchindy', 'จุฑารัตน์ นาคพล', '11407'),
(160, 'user', 'nujaid', 'น.ส.จุรีพร  บัวชุม', '11407'),
(161, 'user', 'nut', 'ชรินทร์พร ชิดมน', '11407'),
(162, 'user', 'nutchanat', 'น.ส.นุชนาฎ  หนูเรือง', '11407'),
(163, 'user', 'nutty', 'นางณัฐวรรณ   จารุพันธุ์', '11407'),
(164, 'user', 'onuma', 'อรอุมา เกตบุญ', '11407'),
(165, 'user', 'opd1', 'งานผู้ป่วยนอก', '11407'),
(166, 'user', 'opd2', 'คลีนิคพิเศษ', '11407'),
(167, 'user', 'oranut7566', 'อรนุช เป้าทอง', '11407'),
(168, 'user', 'orawant', 'น.ส.อรวรรณ ทองขวัญ', '11407'),
(169, 'user', 'othanate', 'ทพ.ธเนศ อัศวกวินทิพย์', '11407'),
(170, 'user', 'pakawan', 'นางผกาวรรณ  พิบูลรัตน์', '11407'),
(171, 'user', 'pannee', 'น.ส.พรรณี  หะหยัง', '11407'),
(172, 'user', 'parichat', 'น.ส.ปริฉัตร อักษรจิตร์', '11407'),
(173, 'user', 'parita', 'น.ส.ปาริตา  อารับ', '11407'),
(174, 'user', 'parn', 'นายสุริยา จันดี', '11407'),
(175, 'user', 'patcha', 'พัชรี นกแก้ว', '11407'),
(176, 'user', 'patcharanath', 'น.ส.พัชรณัฐฐ์  เถกิงรังสฤษดิ์', '11407'),
(177, 'user', 'patcharee', 'ipd น.ส.พัชรี นกแก้ว', '11407'),
(178, 'user', 'patnaree', 'นางพัฒน์นรี  รอดกูล', '11407'),
(179, 'user', 'pattraporn01', 'น.ส.ภัทราพร  ทองปรุง', '11407'),
(180, 'user', 'paweena40', 'พท.ปวีณา หมาดเหล่', '11407'),
(181, 'user', 'pcu1', 'งานเวชปฏิบัติครอบครัว', '11407'),
(182, 'user', 'pekky', 'นิตยา ชิตพงษ์', '11407'),
(183, 'user', 'phanat', 'พญ.พณัชกร มีสิทธิ์', '11407'),
(184, 'user', 'Phimnara', 'นางพิมพ์นารา  แก้วกล่ำ', '11407'),
(185, 'user', 'phing', 'ทพ.ญ.ครองพร  คงครองทอง', '11407'),
(186, 'user', 'phung', 'นาง ประภาพร รัศมีทองคำ', '11407'),
(187, 'user', 'piya', 'นางปิยะฉัตร ฆารเจริญ', '11407'),
(188, 'user', 'plykhem', 'พท.สุดารัตน์ เกตุรัตน์', '11407'),
(189, 'user', 'POL', 'นุสรา กิ้มเท่ง', '11407'),
(190, 'user', 'poppy', 'น.ส.ภัทรสุดา  ขวานเพชร', '11407'),
(191, 'user', 'preecha', 'นายปรีชา  ถิ่นในธร', '11407'),
(192, 'user', 'psycho', 'คลินิกจิตเวช รพช.', '11407'),
(193, 'user', 'puangthip', 'น.ส.พวงทิพย์ ท่ามบุญฤทธิ์', '11407'),
(194, 'user', 'pukpik', 'นางฑริกา  เตียวย่อง', '11407'),
(195, 'user', 'puppypup', 'จิตราพัชร บูก๋ง', '11407'),
(196, 'user', 'Pwrmin', 'นางสาว ภวรัญชน์ หลังหลำ', '11407'),
(197, 'user', 'pyn', 'ภญ.ปิยนุช สีสุข', '11407'),
(198, 'user', 'raktrader', 'นายสิวริศร์  ภูวกรพิพัฒน์', '11407'),
(199, 'user', 'rm', 'คณะกรรมการทีมความเสี่ยง', '11407'),
(200, 'user', 'sainee', 'หุซัยนีย์ หมวดหลำ', '11407'),
(201, 'user', 'santiti', 'นพ.สัณฐิติ สงหนอง', '11407'),
(202, 'user', 'SAOWALUXN', 'เสาวลักษณ์  นาเกลือ', '11407'),
(203, 'user', 'SARUN', 'นายศรัณย์ สลิลปราโมทย์', '11407'),
(204, 'user', 'sasithon', 'ศศิธร แสงสว่าง', '11407'),
(205, 'user', 'savanee', 'นางเสาวนีย์ สงละเอียด', '11407'),
(206, 'user', 'savitree', 'น.ส.สาวิตรี  สักกะพลางกูร', '11407'),
(207, 'user', 'silakpoom', 'นางสิริลักษณ์ พุ่มบ้านเซ่า', '11407'),
(208, 'user', 'sine24', 'น.ส.จุติพร  เกื้อนะ', '11407'),
(209, 'user', 'siri', 'นางสิริรัตน์ เกียรติแสงศิลป์', '11407'),
(210, 'user', 'siriket', 'นางศิริเกษ   เส้งย่อง', '11407'),
(211, 'user', 'sirinnart', 'ภญ.สิรินนาถ เก้าเอี้ยน', '11407'),
(212, 'user', 'somkiat', 'นพ.สมเกียรติ  พยุหเสนารักษ์', '11407'),
(213, 'user', 'sompoy', 'นางสุวรรณี  โส๊ะพันธ์', '11407'),
(214, 'user', 'soraya', 'น.ส.โสรยา แก้วนิลประเสริฐ', '11407'),
(215, 'user', 'student', 'นักศึกษาพยาบาล', '11407'),
(216, 'user', 'suda', 'นางสุดา สมรักษ์', '11407'),
(217, 'user', 'sudaporn', 'น.ส.สุดาพร โกเอี้ยน ทน.10456', '11407'),
(218, 'user', 'sujiragg', 'นางสุจิรา  วณิชชานนท์', '11407'),
(219, 'user', 'Sujittra05', 'น.ส.สุจิตรา สุรวิทย์', '11407'),
(220, 'user', 'sukanya', 'น.ส.สุกัญญา จำปาทอง', '11407'),
(221, 'user', 'sukolrat', 'ภญ.ศุกลรัตน์ ธัญวงศ์', '11407'),
(222, 'user', 'sumete', 'นายสุเมธ ปานชาตรี', '11407'),
(223, 'user', 'sunanya27', 'น.ส.สุนันญา  พูลภิรมย์', '11407'),
(224, 'user', 'sunisa01', 'นางสุนิสา ทองประดับ', '11407'),
(225, 'user', 'sunisap', 'น.ส.สุนิสา ปูขาว', '11407'),
(226, 'user', 'suparatc', 'ศุภรัตน์ ชิตชลธาร', '11407'),
(227, 'user', 'Supawan', 'น.ส.สุภาวรรณ จิตตัง', '11407'),
(228, 'user', 'supply', 'นายกษิดิศ  กิ้มเฉี้ยง', '11407'),
(229, 'user', 'supply1', 'งานจ่ายกลาง', '11407'),
(230, 'user', 'supranee01', 'นางสุปราณี ปิยวาทการ', '11407'),
(231, 'user', 'sutamma', 'ภญ.สุธรรมา ศิริพันธ์', '11407'),
(232, 'user', 'sutipong', 'นายสุทธิพงศ์ ไพรินทร์', '11407'),
(233, 'user', 'suwanya', 'นางสุวัลญา คงรอด', '11407'),
(234, 'user', 'suwaree', 'น.ส.สุวรี  ลิ้มไทย', '11407'),
(235, 'user', 'swan', 'น.ส.อรวี  ปัญจวงศ์', '11407'),
(236, 'user', 'tal', 'นางสิวินีย์ จันทร์คง', '11407'),
(237, 'user', 'tar', 'น.ส.กาญจนา เชื้อสง่า', '11407'),
(238, 'user', 'technic', 'งานซ่อมบำรุง', '11407'),
(239, 'user', 'teeranad', 'น.ส.ธีรนาฎ  จันทร์เสน', '11407'),
(240, 'user', 'tester', 'นายณัฐพล หยิบงามเจริญสุข', '11407'),
(241, 'user', 'thitinan', 'น.ส.ทิฐินันท์  บัวชุม', '11407'),
(242, 'user', 'tidtykanitta', 'น.ส.ขนิษฐา  หมันหมีน', '11407'),
(243, 'user', 'tiriporn', 'น.ส.ฐิริภรณ์ สุทธินนท์', '11407'),
(244, 'user', 'Totsawan', 'นางสาว ทศวรรณ จุลบุษรา', '11407'),
(245, 'user', 'tsr', 'นางสาว ทิพยสิริ ไชยคง', '11407'),
(246, 'user', 'tu', 'น.ส.สุกัญญา จำปาทอง', '11407'),
(247, 'user', 'tuktik', 'น.ส.วรรณฤดี  สุนทรเต็ม', '11407'),
(248, 'user', 'tuna', 'นางสุภัทรา  ธวัชสุวรรณ', '11407'),
(249, 'user', 'unchan', 'นางอัญชัน ทองส่งโสม', '11407'),
(250, 'user', 'uraiwan', 'อุไรวรรณ สืบแต่ตระกูล', '11407'),
(251, 'user', 'veeranut-su', 'น.ส.วีรนุช เกาะสมัน', '11407'),
(252, 'user', 'W67861', 'นพ.โชติพัฒน์ ใจจ้อง', '11407'),
(253, 'user', 'wafer', 'เกศดา เกื้อรอด', '11407'),
(254, 'user', 'watinee3105', 'น.ส.วาทินี ศรีบวรวิวัฒน์', '11407'),
(255, 'user', 'watit', 'นาย วาทิต ชูเกิด', '11407'),
(256, 'user', 'watjanaporn', 'พจ. วจนพร อนรรฆธนะกุล', '11407'),
(257, 'user', 'wattana', 'นางวัฒนา ชมภูนุช', '11407'),
(258, 'user', 'wichuda', 'นางวิชุดา ชาติประยูร', '11407'),
(259, 'user', 'wijit', 'นาย วิจิตร สาลี', '11407'),
(260, 'user', 'wilairat', 'นางวิลัยรัตน์ บุญพรหม', '11407'),
(261, 'user', 'witchuda', 'นางวิชชุดา สุทธินนท์', '11407'),
(262, 'user', 'xray1', 'นายเอกชัย ทนุดี', '11407'),
(263, 'user', 'yawita', 'ทพ.ญ. ญาวิตา ตั้งปอง', '11407'),
(264, 'user', 'ying', 'น.ส.ณภัทรลภา  สองเมือง', '11407'),
(265, 'user', 'yu', 'นางยุวรี จุลบุษรา', '11407'),
(266, 'user', 'yupphalak', 'พท.ยุพลักษณ์ ภูน้ำเย็น', '11407'),
(267, 'user', 'zerofirst', 'ณัชฐปกรณ์ จันดี', '11407'),
(268, 'admin', 'tester1', 'tester1', '11407'),
(270, 'user', 'tester2', 'tester2', '11407'),
(275, 'user', 'tester3', 'tester3', '11407');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `testexcel`
--
ALTER TABLE `testexcel`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `testexcel2`
--
ALTER TABLE `testexcel2`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `uploaded_file`
--
ALTER TABLE `uploaded_file`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `user_his`
--
ALTER TABLE `user_his`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `testexcel`
--
ALTER TABLE `testexcel`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT for table `testexcel2`
--
ALTER TABLE `testexcel2`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT for table `uploaded_file`
--
ALTER TABLE `uploaded_file`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=49;

--
-- AUTO_INCREMENT for table `user_his`
--
ALTER TABLE `user_his`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=276;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
